# Pandas

## 2. DataFrames - Part II

In [1]:
import numpy as np
import pandas as pd

In [8]:
# setup
from numpy.random import randn
np.random.seed(101)

In [9]:
df = pd.DataFrame(data=randn(5,4), index=['A','B','C','D','E'], columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Conditional Selection

In [12]:
# df>0 returns a boolean data frame with the result of the condition evaluated to true or false
# df[df > 0] returns a data frame with elements that evaluated to True and nulls, where the condition evaluated
# to False.
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
# df['W']>0 returns a boolean Series with the result of the condition evaluated to true or false
# df[df['W] > 0] returns a data frame with only those indexes (rows) for which df['W']>0 evaluated to True
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

<b>NOTE: The advantage of using a boolean Series for conditional selection is that you don't end up getting nulls for places the condition evaluated to False, which you get otherwise, if you do a conditional operation on the entire dataframe and use the resulting boolean data frame for selection.</b>

In [18]:
# df[df['Z'] > 0] returns a data frame; thus, you can apply all normal data frame operations to the resulting
# data frame.
df[df['Z'] > 0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

## Multiple Conditions

In [19]:
df[(df['W'] > 0) and (df['Y'] > 1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

<b>NOTE: The above error occurs because the python and operator only works on True and False boolean values and not on boolean Series. Thus multiple conditions require you to use the & operator</b>

In [21]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Indexing

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# Resetting index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [25]:
# Setting new index
newind = 'CA NY WY OR CO'.split()
df['State'] = newind
df.set_index('State')

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509